Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ</name>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоОрганизациям</registerRecords>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоРегионам</registerRecords>
  <attributes>
    <name>additionalInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applExaminationOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applExamPeriodTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>auctionTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>deliveryEndDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>deliveryPlaceIndication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>deliveryStartDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>electronicPlaceInfo</name>
    <type>
      <types>CatalogRef.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка</types>
    </type>
  </attributes>
  <attributes>
    <name>envelopeOpeningOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>examinationDateTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>examinationPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>forSmallOrMiddle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>guid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>href</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>modificationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>modificationDescription</name>
    <comment>заполняется в случае внесения изменений в документы извещения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>purchaseObjectInfo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>place</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>procedure</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>publicationDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>publicationPlannedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>purchaseMethodCode</name>
    <type>
      <types>CatalogRef.ГЗ_placingWay_ПодспособОпределенияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>registrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>submissionCloseDateTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>summingupPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>summingupTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>version</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>initialSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>lot</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OKEI</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>purchaseObject_Строкой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>guid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ordinalNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>lotEditEnabled</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>deliveryPlaceIndication</name>
      <comment>Допустимые значения:  ¶-	GL : Указывается общее для лота - ELP : Указывается для каждой позиции лота ¶-	LC : Указывается в сведениях по участнику совместной закупки - GA : Указывается общее для организации ¶-	EP : Указывается для каждой позиции ¶</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>subject</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>deliveryPlace</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>customerQuantities</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>customer</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ/ManagerModule.bsl
// Создает документ по переданной структуре
//
// Параметры:
//  - ДанныеЗаполнения - Структура - структура свойств документа
//
// Возвращаемое значение:
//  - Ссылка - ссылка на созданный элемент справочника
//
Функция СоздатьДокументИзвещение(ДанныеЗаполнения) Экспорт
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		НайденныйДокумент = Документы.ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ.НайтиПоРеквизиту("registrationNumber",ДанныеЗаполнения.registrationNumber) ;
		
		Если НайденныйДокумент.Пустая() Тогда 
			ДокументГЗ = Документы.ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ.СоздатьДокумент();
		Иначе 	
			ДокументГЗ = НайденныйДокумент.ПолучитьОбъект();
			ДокументГЗ.lot.Очистить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументГЗ,ДанныеЗаполнения);
		ДокументГЗ.lot.Загрузить(ДанныеЗаполнения.lot);
		Попытка
			ДокументГЗ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументГЗ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("ГЗ.ЗагрузкаДанныхИзXML", УровеньЖурналаРегистрации.Ошибка,,,"Пустая структура для заполнения документа");
	КонецЕсли;	
	//Возврат ДокументСсылка;
КонецФункции

Функция ВернутьСтруктуруТабличнойЧастиДокумента() Экспорт 
	ТабличнаяЧастьИзвещения = Новый	 ТаблицаЗначений;
	ТабличнаяЧастьИзвещения.Колонки.Добавить("purchaseObject", ,"purchaseObject");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("purchaseObject_Строкой", ,"purchaseObject_Строкой");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("price", ,"price");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("quantity", ,"quantity");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("sum", ,"sum");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("isMedicalProduct", ,"isMedicalProduct");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("OKEI", ,"OKEI");
	ТабличнаяЧастьИзвещения.Колонки.Добавить("name", ,"name");
	Возврат  ТабличнаяЧастьИзвещения;
КонецФункции
